microhal/microhal/microhal/ports/stmCommon/registers/peripheralBaseAddressDefinitions/registersBaseAddressDefinitions_stm32f107.h
#ifndef _MICROHAL_REGISTERS_BASE_ADDRESS_DEFINITIONS_STM32F107_H_
#define _MICROHAL_REGISTERS_BASE_ADDRESS_DEFINITIONS_STM32F107_H_

#define _MICROHAL_PWR_BASE_ADDRESS 0x40007000
#define _MICROHAL_RCC_BASE_ADDRESS 0x40021000
#define _MICROHAL_GPIOA_BASE_ADDRESS 0x40010800
#define _MICROHAL_GPIOB_BASE_ADDRESS 0x40010C00
#define _MICROHAL_GPIOC_BASE_ADDRESS 0x40011000
#define _MICROHAL_GPIOD_BASE_ADDRESS 0x40011400
#define _MICROHAL_GPIOE_BASE_ADDRESS 0x40011800
#define _MICROHAL_GPIOF_BASE_ADDRESS 0x40011C00
#define _MICROHAL_GPIOG_BASE_ADDRESS 0x40012000
#define _MICROHAL_AFIO_BASE_ADDRESS 0x40010000
#define _MICROHAL_EXTI_BASE_ADDRESS 0x40010400
#define _MICROHAL_DMA1_BASE_ADDRESS 0x40020000
#define _MICROHAL_DMA2_BASE_ADDRESS 0x40020400
#define _MICROHAL_RTC_BASE_ADDRESS 0x40002800
#define _MICROHAL_BKP_BASE_ADDRESS 0x40006C00
#define _MICROHAL_IWDG_BASE_ADDRESS 0x40003000
#define _MICROHAL_WWDG_BASE_ADDRESS 0x40002C00
#define _MICROHAL_TIM1_BASE_ADDRESS 0x40012C00
#define _MICROHAL_TIM2_BASE_ADDRESS 0x40000000
#define _MICROHAL_TIM3_BASE_ADDRESS 0x40000400
#define _MICROHAL_TIM4_BASE_ADDRESS 0x40000800
#define _MICROHAL_TIM5_BASE_ADDRESS 0x40000C00
#define _MICROHAL_TIM6_BASE_ADDRESS 0x40001000
#define _MICROHAL_TIM7_BASE_ADDRESS 0x40001400
#define _MICROHAL_I2C1_BASE_ADDRESS 0x40005400
#define _MICROHAL_I2C2_BASE_ADDRESS 0x40005800
#define _MICROHAL_SPI1_BASE_ADDRESS 0x40013000
#define _MICROHAL_SPI2_BASE_ADDRESS 0x40003800
#define _MICROHAL_SPI3_BASE_ADDRESS 0x40003C00
#define _MICROHAL_USART1_BASE_ADDRESS 0x40013800
#define _MICROHAL_USART2_BASE_ADDRESS 0x40004400
#define _MICROHAL_USART3_BASE_ADDRESS 0x40004800
#define _MICROHAL_ADC1_BASE_ADDRESS 0x40012400
#define _MICROHAL_ADC2_BASE_ADDRESS 0x40012800
#define _MICROHAL_CAN2_BASE_ADDRESS 0x40006800
#define _MICROHAL_CAN1_BASE_ADDRESS 0x40006400
#define _MICROHAL_ETHERNET_MAC_BASE_ADDRESS 0x40028000
#define _MICROHAL_ETHERNET_MMC_BASE_ADDRESS 0x40028100
#define _MICROHAL_ETHERNET_PTP_BASE_ADDRESS 0x40028700
#define _MICROHAL_ETHERNET_DMA_BASE_ADDRESS 0x40029000
#define _MICROHAL_USB_OTG_GLOBAL_BASE_ADDRESS 0x50000000
#define _MICROHAL_USB_OTG_HOST_BASE_ADDRESS 0x50000400
#define _MICROHAL_USB_OTG_DEVICE_BASE_ADDRESS 0x50000800
#define _MICROHAL_USB_OTG_PWRCLK_BASE_ADDRESS 0x50000E00
#define _MICROHAL_DAC_BASE_ADDRESS 0x40007400
#define _MICROHAL_DBG_BASE_ADDRESS 0xE0042000
#define _MICROHAL_UART4_BASE_ADDRESS 0x40004C00
#define _MICROHAL_UART5_BASE_ADDRESS 0x40005000
#define _MICROHAL_CRC_BASE_ADDRESS 0x40023000
#define _MICROHAL_FLASH_BASE_ADDRESS 0x40022000
#define _MICROHAL_FSMC_BASE_ADDRESS 0xA0000000
#define _MICROHAL_SDIO_BASE_ADDRESS 0x40018000
#define _MICROHAL_TIM11_BASE_ADDRESS 0x40015400
#define _MICROHAL_TIM10_BASE_ADDRESS 0x40015000
#define _MICROHAL_TIM9_BASE_ADDRESS 0x40014C00
#define _MICROHAL_TIM12_BASE_ADDRESS 0x40001800
#define _MICROHAL_ADC3_BASE_ADDRESS 0x40013C00
#define _MICROHAL_TIM8_BASE_ADDRESS 0x40013400
#define _MICROHAL_USB_BASE_ADDRESS 0x40005C00
#define _MICROHAL_TIM13_BASE_ADDRESS 0x40001C00
#define _MICROHAL_TIM14_BASE_ADDRESS 0x40002000
#define _MICROHAL_NVIC_BASE_ADDRESS 0xE000E100
#define _MICROHAL_MPU_BASE_ADDRESS 0xE000ED90
#define _MICROHAL_SCB_ACTRL_BASE_ADDRESS 0xE000E008
#define _MICROHAL_NVIC_STIR_BASE_ADDRESS 0xE000EF00
#define _MICROHAL_SCB_BASE_ADDRESS 0xE000ED00
#define _MICROHAL_STK_BASE_ADDRESS 0xE000E010

#endif // _MICROHAL_REGISTERS_BASE_ADDRESS_DEFINITIONS_STM32F107_H_
